In [1]:
import numpy as np

In [3]:
import pandas as pd

In [14]:
my_series = pd.Series([1, 2, 3, 4, 5], index = ['row1', 'row2', 'row3', 'row4', 'row5'])
my_series

row1    1
row2    2
row3    3
row4    4
row5    5
dtype: int64

In [15]:
my_series.values

array([1, 2, 3, 4, 5], dtype=int64)

In [16]:
my_series.index

Index(['row1', 'row2', 'row3', 'row4', 'row5'], dtype='object')

In [17]:
my_series.row2

2

In [18]:
my_series['row2']

2

In [19]:
my_series[my_series > 3]

row4    4
row5    5
dtype: int64

In [20]:
my_series.rename({'row1':'a', 'row2':'b', 'row3':'c', 'row4':'d', 'row5':'e'})

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [24]:
my_array = np.array([[1,5,9,13], [2,6,10,14], [3,7,11,15], [4,8,12,16]])
my_dataframe = pd.DataFrame(my_array, index = ['row1', 'row2', 'row3', 'row4']
                           ,columns = ['col1', 'col2', 'col3', 'col4'])
my_dataframe

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [25]:
my_dict = {'col1':[1, 2, 3, 4], 'col2':[5, 6, 7, 8], 'col3':[9, 10, 11,12], 'col4':[13, 14, 15, 16]}
my_dataframe2 = pd.DataFrame(my_dict, index = ['row1', 'row2', 'row3', 'row4']
                            ,columns = ['col1', 'col2', 'col3', 'col4'])
my_dataframe2

      col1  col2  col3  col4
row1     1     5     9    13
row2     2     6    10    14
row3     3     7    11    15
row4     4     8    12    16

In [26]:
my_dataframe.index

Index(['row1', 'row2', 'row3', 'row4'], dtype='object')

In [27]:
my_dataframe.columns

Index(['col1', 'col2', 'col3', 'col4'], dtype='object')

In [28]:
my_dataframe.values

array([[ 1,  5,  9, 13],
       [ 2,  6, 10, 14],
       [ 3,  7, 11, 15],
       [ 4,  8, 12, 16]])

In [29]:
my_dataframe.loc['row1']['col2']

5

In [30]:
my_dataframe.iloc[0][1]

5

In [31]:
my_dataframe['col5'] = [20, 21, 22, 23]

In [32]:
my_dataframe

      col1  col2  col3  col4  col5
row1     1     5     9    13    20
row2     2     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

In [33]:
my_dataframe.loc[['row1', 'row2'], 'col1'] = 0

In [34]:
my_dataframe

      col1  col2  col3  col4  col5
row1     0     5     9    13    20
row2     0     6    10    14    21
row3     3     7    11    15    22
row4     4     8    12    16    23

In [36]:
my_dataframe.reset_index(drop=True, inplace=True)
my_dataframe

   col1  col2  col3  col4  col5
0     0     5     9    13    20
1     0     6    10    14    21
2     3     7    11    15    22
3     4     8    12    16    23

In [37]:
my_dataframe.drop('col5', axis = 1, inplace=True)
my_dataframe

   col1  col2  col3  col4
0     0     5     9    13
1     0     6    10    14
2     3     7    11    15
3     4     8    12    16

In [39]:
my_dataframe.rename(columns={'col4':'c4'}, inplace=True)
my_dataframe

   col1  col2  col3  c4
0     0     5     9  13
1     0     6    10  14
2     3     7    11  15
3     4     8    12  16

In [40]:
my_dataframe.replace(0, 1)

   col1  col2  col3  c4
0     1     5     9  13
1     1     6    10  14
2     3     7    11  15
3     4     8    12  16

In [47]:
my_dataframe.col1 = ['{:.2f}'.format(float(x)) for x in my_dataframe.iloc[:, 0]]
my_dataframe

   col1  col2  col3  c4
0  0.00     5     9  13
1  0.00     6    10  14
2  3.00     7    11  15
3  4.00     8    12  16

In [48]:
my_dataframe['col2'] = my_dataframe['col2'].apply(lambda x: '{:.2f}'.format(float(x)))
my_dataframe

   col1  col2  col3  c4
0  0.00  5.00     9  13
1  0.00  6.00    10  14
2  3.00  7.00    11  15
3  4.00  8.00    12  16

In [49]:
my_dataframe.sort_index(axis = 1, ascending = False)

   col3  col2  col1  c4
0     9  5.00  0.00  13
1    10  6.00  0.00  14
2    11  7.00  3.00  15
3    12  8.00  4.00  16

In [50]:
my_dataframe.sort_index(axis = 0, ascending = False)

   col1  col2  col3  c4
3  4.00  8.00    12  16
2  3.00  7.00    11  15
1  0.00  6.00    10  14
0  0.00  5.00     9  13

In [52]:
my_dataframe.sort_values(by = 'col1', ascending = False)

   col1  col2  col3  c4
3  4.00  8.00    12  16
2  3.00  7.00    11  15
0  0.00  5.00     9  13
1  0.00  6.00    10  14

In [53]:
my_dataframe.head(2)

   col1  col2  col3  c4
0  0.00  5.00     9  13
1  0.00  6.00    10  14

In [54]:
my_dataframe.tail(2)

   col1  col2  col3  c4
2  3.00  7.00    11  15
3  4.00  8.00    12  16

In [58]:
my_data = pd.read_csv('https://people.sc.fsu.edu/~jburkardt/data/csv/addresses.csv')
my_data

,John,Doe,120 jefferson st.,Riverside,NJ,08075
0,Jack,McGinnis,220 hobo Av.,Phila,PA,9119
1,"John ""Da Man""",Repici,120 Jefferson St.,Riverside,NJ,8075
2,Stephen,Tyler,"7452 Terrace ""At the Plaza"" road",SomeTown,SD,91234
3,NaN,Blankman,NaN,SomeTown,SD,298
4,"Joan ""the bone"", Anne",Jet,"9th, at Terrace plc",Desert City,CO,123